PostboxRetinal/esp32_iot/src/main.cpp
#include <Arduino.h>
#include <ArduinoJson.h>
#include <PubSubClient.h>
#include <WiFi.h>
#include <esp32-hal-rgb-led.h>
#include <math.h>
#include <time.h>

#include "app_config.h"

#define MQ7_PIN    4
#define PIR_PIN    5

WiFiClient wifiClient;
PubSubClient mqttClient(wifiClient);

unsigned long lastBlinkMs = 0;
unsigned long lastTelemetryMs = 0;
unsigned long lastHeartbeatMs = 0;
unsigned long lastWifiRetryMs = 0;
unsigned long lastMqttRetryMs = 0;
bool ledState = false;
uint32_t messageCounter = 0;
bool mq7SaturationWarned = false;

char topicTelemetry[96];
char topicStatus[96];
char topicHeartbeat[96];

void buildTopics() {
  snprintf(topicTelemetry, sizeof(topicTelemetry), "%s/telemetry", MQTT_TOPIC_BASE);
  snprintf(topicStatus, sizeof(topicStatus), "%s/%s/status", MQTT_TOPIC_BASE, DEVICE_ID);
  snprintf(topicHeartbeat, sizeof(topicHeartbeat), "%s/%s/heartbeat", MQTT_TOPIC_BASE, DEVICE_ID);
}

float calcularPPM(int rawValue) {
  if (rawValue >= MQ7_ADC_SATURATION_RAW) {
    return MQ7_SATURATED_FALLBACK_PPM;
  }

  if (rawValue <= 0) {
    rawValue = 1;
  }

  float voltage = rawValue * (MQ7_ADC_REF_VOLTAGE / 4095.0f);
  if (voltage < 0.01f) {
    voltage = 0.01f;
  }

  float rs = (MQ7_SENSOR_VCC_VOLTAGE - voltage) / voltage * MQ7_LOAD_RESISTOR_KOHM;
  float ratio = rs / RO;
  float ppm = MQ7_CURVE_A * pow(ratio, MQ7_CURVE_B);

  if (isnan(ppm) || isinf(ppm) || ppm < 0.0f) {
    return 0.0f;
  }

  return ppm;
}

void setRgbLed(uint8_t red, uint8_t green, uint8_t blue) {
  neopixelWrite(RGB_BUILTIN, red, green, blue);
}

void runLedSelfTest() {
  Serial.println("[LED] Self-test: RED -> GREEN -> BLUE");
  setRgbLed(RGB_BRIGHTNESS, 0, 0);
  delay(LED_SELF_TEST_MS);
  setRgbLed(0, RGB_BRIGHTNESS, 0);
  delay(LED_SELF_TEST_MS);
  setRgbLed(0, 0, RGB_BRIGHTNESS);
  delay(LED_SELF_TEST_MS);
  setRgbLed(0, 0, 0);
}

void printBoardInfo() {
  uint32_t flashKb = ESP.getFlashChipSize() / 1024;
  Serial.printf("[BOARD] Flash: %u KB (%u MB)\n", flashKb, flashKb / 1024);
  Serial.printf("[BOARD] PSRAM: %u KB total, %u KB free\n", ESP.getPsramSize() / 1024, ESP.getFreePsram() / 1024);
}

void waitForSerialConsole() {
#if ARDUINO_USB_CDC_ON_BOOT
  unsigned long start = millis();
  while (!Serial && millis() - start < 3000) {
    delay(10);
  }
#else
  delay(300);
#endif
}

String getTimestamp() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 100)) {
    return "1970-01-01T00:00:00-05:00";
  }

  char buf[30];
  strftime(buf, sizeof(buf), "%Y-%m-%dT%H:%M:%S-05:00", &timeinfo);
  return String(buf);
}

void ensureWiFiConnection() {
  if (WiFi.status() == WL_CONNECTED) {
    return;
  }

  unsigned long now = millis();
  if (now - lastWifiRetryMs < WIFI_RETRY_INTERVAL_MS) {
    return;
  }

  lastWifiRetryMs = now;
  Serial.println("[WiFi] Conexion perdida. Intentando reconexion...");
  WiFi.disconnect();
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
}

bool connectMqtt() {
  if (WiFi.status() != WL_CONNECTED) {
    return false;
  }

  bool connected = mqttClient.connect(
    DEVICE_ID,
    MQTT_USERNAME,
    MQTT_PASSWORD,
    topicStatus,
    1,
    true,
    "offline"
  );

  if (!connected) {
    Serial.print("[MQTT] Conexion fallida. rc=");
    Serial.println(mqttClient.state());
    return false;
  }

  Serial.println("[MQTT] Conectado al broker.");
  mqttClient.publish(topicStatus, "online", true);
  return true;
}

void ensureMqttConnection() {
  if (mqttClient.connected() || WiFi.status() != WL_CONNECTED) {
    return;
  }

  unsigned long now = millis();
  if (now - lastMqttRetryMs < MQTT_RETRY_INTERVAL_MS) {
    return;
  }

  lastMqttRetryMs = now;
  connectMqtt();
}

String clasificarEstado(float co_ppm, int raw_adc, int pir) {
  String estado;

  if (co_ppm < CO_SEGURO_MAX_PPM && raw_adc < MQ7_ADC_SEGURO_RAW_MAX) {
    estado = "SEGURO";
    setRgbLed(0, RGB_BRIGHTNESS, 0);
    ledState = false;
  } else if (co_ppm < CO_PRECAUCION_MAX_PPM && raw_adc < MQ7_ADC_PRECAUCION_RAW_MAX) {
    estado = "PRECAUCION";
    setRgbLed(RGB_BRIGHTNESS, RGB_BRIGHTNESS, 0);
    ledState = false;
  } else if (co_ppm < CO_PELIGRO_MAX_PPM && raw_adc < MQ7_ADC_PELIGRO_RAW_MAX) {
    estado = "PELIGRO";
    setRgbLed(RGB_BRIGHTNESS, 0, 0);
    ledState = false;
  } else {
    estado = "CRITICO";
    if (millis() - lastBlinkMs >= 150) {
      lastBlinkMs = millis();
      ledState = !ledState;
      setRgbLed(ledState ? RGB_BRIGHTNESS : 0, 0, 0);
    }
  }

  if (pir == 1 && (co_ppm > CO_URGENTE_MIN_PPM || raw_adc > MQ7_ADC_URGENTE_MIN_PPM)) {
    estado += "_URGENTE";
  }

  return estado;
}

void publishTelemetry(int rawCO, float co_ppm, int pir, const String& estado) {
  JsonDocument doc;
  doc["message_id"] = ++messageCounter;
  doc["device_id"] = DEVICE_ID;
  doc["timestamp"] = getTimestamp();
  doc["presencia"] = (pir == 1) ? "SI" : "NO";
  doc["co_ppm"] = roundf(co_ppm * 10.0f) / 10.0f;
  doc["raw_co_adc"] = rawCO;
  doc["estado"] = estado;

  char payload[384];
  size_t len = serializeJson(doc, payload, sizeof(payload));

  if (len == 0) {
    Serial.println("[MQTT] Error serializando payload JSON.");
    return;
  }

  if (mqttClient.connected()) {
    bool sent = mqttClient.publish(topicTelemetry, payload, false);
    if (!sent) {
      Serial.println("[MQTT] Error publicando telemetry.");
    }
  }

  serializeJsonPretty(doc, Serial);
  Serial.println();
}

void publishHeartbeat() {
  if (!mqttClient.connected()) {
    return;
  }

  JsonDocument hb;
  hb["device_id"] = DEVICE_ID;
  hb["timestamp"] = getTimestamp();
  hb["status"] = "online";
  hb["uptime_ms"] = millis();
  hb["rssi"] = WiFi.RSSI();

  char payload[256];
  size_t len = serializeJson(hb, payload, sizeof(payload));

  if (len > 0) {
    mqttClient.publish(topicHeartbeat, payload, true);
  }
}

void setup() {
  Serial.begin(115200);
  waitForSerialConsole();
  printBoardInfo();

  pinMode(PIR_PIN,   INPUT);
  runLedSelfTest();
  setRgbLed(0, RGB_BRIGHTNESS, 0);

  buildTopics();

  mqttClient.setServer(MQTT_BROKER_HOST, MQTT_BROKER_PORT);
  mqttClient.setBufferSize(512);

  // WiFi
  Serial.print("Conectando a WiFi...");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  unsigned long wifiStart = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - wifiStart < WIFI_CONNECT_TIMEOUT_MS) {
    delay(500);
    Serial.print(".");
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println(" conectado.");
    Serial.print("IP: ");
    Serial.println(WiFi.localIP());
  } else {
    Serial.println(" no disponible, se intentara reconexion en loop().");
  }

  // NTP — GMT-5
  configTime(TZ_OFFSET_SECONDS, TZ_DAYLIGHT_OFFSET, NTP_SERVER_1, NTP_SERVER_2);
  Serial.print("Sincronizando hora...");
  struct tm timeinfo;

  int retries = 0;
  while (!getLocalTime(&timeinfo, 500) && retries < 10) {
    delay(500);
    Serial.print(".");
    retries++;
  }

  if (retries < 10) {
    Serial.println(" listo.");
  } else {
    Serial.println(" no disponible, se usara timestamp por NTP cuando vuelva la red.");
  }

  if (WiFi.status() == WL_CONNECTED) {
    connectMqtt();
  }

  Serial.println("Calentando sensor MQ-7 (5s) ...");
  delay(MQ7_WARMUP_MS);
  Serial.println("Sistema listo.");
}

void loop() {
  ensureWiFiConnection();
  ensureMqttConnection();
  mqttClient.loop();

  unsigned long now = millis();

  if (now - lastHeartbeatMs >= HEARTBEAT_INTERVAL_MS) {
    lastHeartbeatMs = now;
    publishHeartbeat();
  }

  int rawCO = analogRead(MQ7_PIN);
  if (rawCO >= MQ7_ADC_SATURATION_RAW) {
    if (!mq7SaturationWarned) {
      Serial.println("[MQ7] ADC saturado (raw ~4095). Revisa cableado/divisor a 3.3V. Aplicando fallback de ppm.");
      mq7SaturationWarned = true;
    }
  } else {
    mq7SaturationWarned = false;
  }

  float co_ppm = calcularPPM(rawCO);
  int pir = digitalRead(PIR_PIN);
  String estado = clasificarEstado(co_ppm, rawCO, pir);

  if (now - lastTelemetryMs >= TELEMETRY_PUBLISH_INTERVAL_MS) {
    lastTelemetryMs = now;
    publishTelemetry(rawCO, co_ppm, pir, estado);
  }

  delay(20);
}
